# Library Management system

In [2]:
# importing pandas to read the query
import pandas as pd
# importing sqllite3 to store the data in the tables
import sqlite3
con = sqlite3.connect('test.db')
print("Opened database successfully")

Opened database successfully

### Creating tables

In [28]:
con.execute('drop table books')

OperationalError: database is locked

In [8]:
# creating table books
# con.execute('''
# create table books(
# b_id int primary key,
# b_name varchar(50),
# b_author varchar(25),
# b_genre varchar(25),
# b_availablity varchar(25)
# )
# ''')

In [10]:
# creating a new table reader
# con.execute('''
# create table reader(
# r_id int primary key,
# r_name varchar(25)
# );
# ''')

In [11]:
# creating a new table bookissued
# con.execute('''
# create table bookissued(
# r_id references reader(r_id),
# b_id references books(b_id)
# );
# ''')

In [14]:
cursor = con.cursor()
cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
for i in cursor.fetchall():
    print(i[0])

books
reader
bookissued

In [16]:
def showall_tables():
    cursor = con.cursor()
    cursor.execute("SELECT name FROM sqlite_master WHERE type='table';")
    for i in cursor.fetchall():
        print(i[0])

### Inserting initial records to tables

In [13]:
# inserting data into the table books
con.execute('''
INSERT INTO books
values
(3, 'Harry Potter and the Philosopher Stone', 'J. K. Rowling', 'Fantasy', 'Available'),
(4, 'Harry Potter and the Goblet of Fire', 'J. K. Rowling', 'Fantasy', 'Available'),
(5, 'Blood of Elves', 'Andrzej Sapkowski', 'Fantasy', 'Issued'),
(6, 'Time of Contempt ', 'Andrzej Sapkowski', 'Fantasy', 'Available'),
(7, 'Baptism of Fire ', 'Andrzej Sapkowski', 'Fantasy', 'Available'),
(8, 'The Tower of the Swallow', 'Andrzej Sapkowski', 'Fantasy', 'Issued'),
(9, 'The Lady of the Lake', 'Andrzej Sapkowski', 'Fantasy', 'Issued')
''')
con.commit()

In [ ]:
# inserting data into the table reader
con.execute('''
insert into reader values
(1001,'Arun'),
(1002,'Rick'),
(1003,'Morty'),
(1004,'Summer');
''')
con.commit()

In [ ]:
# inserting data into the table bookissued
con.execute(f'''
insert into bookissued values
(1001,8),
(1002,2),
(1003,9),
(1004,5),
(1001,4)
''')
con.commit()

### Viewing records of the tables

In [4]:
def table_books():
    print('Table : books')
    display(pd.read_sql_query('select * from books',con))

In [77]:
print('Table : books')
pd.read_sql_query('select * from books',con)

Table : books

,b_id,b_name,b_author,b_genre,b_availablity
0,3,Harry Potter and the Philosopher Stone,J. K. Rowling,Fantasy,Available
1,4,Harry Potter and the Goblet of Fire,J. K. Rowling,Fantasy,Issued
2,5,Blood of Elves,Andrzej Sapkowski,Fantasy,Issued
3,6,Time of Contempt,Andrzej Sapkowski,Fantasy,Available
4,7,Baptism of Fire,Andrzej Sapkowski,Fantasy,Available
5,8,The Tower of the Swallow,Andrzej Sapkowski,Fantasy,Issued
6,9,The Lady of the Lake,Andrzej Sapkowski,Fantasy,Issued
7,10,The Hunger Games,Suzanne Collins,Science fiction,Available

In [5]:
def table_reader():
    print('Table : reader')
    display(pd.read_sql_query('select * from reader',con))

In [70]:
print('Table : reader')
pd.read_sql_query('select * from reader',con)

Table : reader

   r_id  r_name
0  1001    Arun
1  1002    Rick
2  1003   Morty
3  1004  Summer
4  1005   Jerry

In [6]:
def table_bookissued():
    print('Table : bookissued')
    display(pd.read_sql_query('select * from bookissued',con))

In [74]:
print('Table : bookissued')
pd.read_sql_query('select * from bookissued',con)

Table : bookissued

   r_id  b_id
0  1001     8
1  1002     2
2  1003     9
3  1004     5
4  1001     4

### Updating records in the table

In [7]:
def add_new_reader():
    reader_id, reader_name = int(pd.read_sql_query('select r_id from reader order by r_id desc limit 1',con).values[0][0]) + 1, input('Enter name of the reader : ')
    try:
        con.execute(f'insert into reader values({reader_id},\'{reader_name}\');')
        con.commit()
        print(f'Successfully {reader_name} added to table reader')
    except:
        print('Update unsuccessfull!')

In [69]:
# add new reader
reader_id, reader_name = int(pd.read_sql_query('select r_id from reader order by r_id desc limit 1',con).values[0][0]) + 1, input('Enter name of the reader : ')
try:
    con.execute(f'insert into reader values({reader_id},\'{reader_name}\');')
    con.commit()
    print(f'Successfully {reader_name} added to table reader')
except:
    print('Update unsuccessfull!')

Enter name of the reader : Jerry
Successfully Jerry added to table reader

In [71]:
# add new book
b_id = int(pd.read_sql_query('select b_id from books order by b_id desc limit 1', con).values[0][0]) + 1
b_name = input('Enter the name of the book : ')
b_author = input('Enter the name of the Author : ')
b_genre = input('Enter the name of the Genre : ')
try:
    con.execute(f"insert into books values({b_id}, '{b_name}', '{b_author}', '{b_genre}', 'Available')")
    con.commit()
    print(f'Successfully {b_name} added to table books')
else:
    print('Update unsuccessfull!')

Enter the name of the book : The Hunger Games
Enter the name of the Author : Suzanne Collins
Enter the name of the Genre : Science fiction

In [75]:
# reading the query using .read_sql_query
data = pd.read_sql_query('select * from books',con)

In [76]:
# search books
search_books = input('Enter the name of the book : ')
for i in [f'Book id : {i},  Name : {j}' for i,j in zip(data.b_id,data.b_name) if search_books.lower() in j.lower()]:
    print(i)

Enter the name of the book : harry
Book id : 3,  Name : Harry Potter and the Philosopher Stone
Book id : 4,  Name : Harry Potter and the Goblet of Fire

In [19]:
# selecting the book id
search_id = int(input('Enter the book id : '))
search_pd_book = pd.read_sql_query(f'select * from books where b_id = {search_id}',con)

if len(search_pd_book):
    display(search_pd_book)
else:
    print('No records found!')

Enter the book id : 4

,b_id,b_name,b_author,b_genre,b_availablity
0,4,Harry Potter and the Goblet of Fire,J. K. Rowling,Fantasy,Issued

In [28]:
# search who's having the book
search_book_reader = input('Enter the name of the book : ')
search_pd_reader = pd.read_sql_query(f'''
select bookissued.b_id, reader.r_id, reader.r_name 
from bookissued inner join reader 
on bookissued.r_id=reader.r_id 
where bookissued.b_id = {search_book_reader}
''',con)

if len(search_pd_reader):
    print('Book is issued!')
    display(search_pd_reader)
else:
    print('Book is Available!')

Enter the name of the book : 4
Book is issued!

   b_id  r_id r_name
0     4  1001   Arun

In [43]:
print([('Book is issued!',display(search_pd_reader)) if len(search_pd_reader) else 'Book is Available!'][0][0])

   b_id  r_id r_name
0     4  1001   Arun

Book is issued!

### Issue and Return book

In [8]:
# issue book
def issue_book():
    user_id = input('Enter user ID : ')
    book_id = input('Enter the book id : ')

    def bookids():
        return [i for i in pd.read_sql_query('select b_id from bookissued',con).b_id]

    if int(book_id) not in bookids():
        con.execute(f'''INSERT INTO bookissued VALUES({user_id},{book_id});''')
        con.execute(f"update books set b_availablity = 'Issued' where b_id = {book_id};")
        print('Book Successfully updated')    
    else:
        print('Book is not available for issue')

In [9]:
# return book
def return_book():
    book_id = input('Enter the book id : ')
    user_id = input('Enter user ID : ')
    con.execute(f'DELETE from bookissued where b_id ={book_id} and r_id={user_id}')
    con.execute(f'update books set b_availablity = \'Available\' where b_id ={book_id}')
    con.commit()

### Remove records from tables

In [27]:
# def remove_books():
display(pd.read_sql_query('select * from books',con))
remove_books = input('enter the book id')
query = pd.read_sql_query(f'select * from books where b_id = {remove_books}',con)
if (query['b_availablity'] == 'Issued')[0]:
    print('Issued book cannot be removed.')
    print()
else:
    con.execute(f'delete from books where b_id = {remove_books}')
    con.commit()
    print('Book Successfully Deleted')
    print()

,b_id,b_name,b_author,b_genre,b_availablity
0,3,Harry Potter and the Philosopher Stone,J. K. Rowling,Fantasy,Available
1,4,Harry Potter and the Goblet of Fire,J. K. Rowling,Fantasy,Issued
2,5,Blood of Elves,Andrzej Sapkowski,Fantasy,Issued
3,6,Time of Contempt,Andrzej Sapkowski,Fantasy,Available
4,7,Baptism of Fire,Andrzej Sapkowski,Fantasy,Available
5,8,The Tower of the Swallow,Andrzej Sapkowski,Fantasy,Issued
6,9,The Lady of the Lake,Andrzej Sapkowski,Fantasy,Issued
7,10,The Hunger Games,Suzanne Collins,Science fiction,Available

enter the book id 6

OperationalError: database is locked

In [19]:
def remove_reader():
    display(pd.read_sql_query('select * from reader',con))
    remove_user = input('enter the user id')
    query = pd.read_sql_query(f'select * from bookissued where r_id = {remove_user}',con)
    try:
        print('User cannot be removed before returning the book.')
        print()
    except:
        con.execute(f'delete from reader where r_id = {remove_user}');con.commit()
        print('User Successfully Deleted')
        print()

   r_id  r_name
0  1001    Arun
1  1002    Rick
2  1003   Morty
3  1004  Summer
4  1005   Jerry

enter the user id 1005

User cannot be removed before returning the book.

In [17]:
while(True):
    print('Welcome to the Library managment system')
    con = sqlite3.connect('test.db')
    print(''' 
    Please choose an option from below menu:
    1. Issue a book
    2. Return a book
    3. View records
    4. Update records
    5. Remove records
    6. Exit
    ''')
    print()

    try:
        user_input = int(input())
    except:
        print('Entered input is not a number please try again')
        print()

    if user_input == 1:
        issue_book()
    elif user_input == 2:
        return_book()
    elif user_input == 3:
        print('Records tables : ')
        showall_tables()
        print()
        user_input_view = input('Please select a table to view')

        if user_input_view == 'books':
            table_books()
        elif user_input_view == 'reader':
            table_reader()
        elif user_input_view == 'bookissued':
            table_bookissued()
        else:
            print('Please check the spelling')
    elif user_input == 4:
        pass
    elif user_input == 5:
        print('''Please select a table : 
        1. books
        2. reader
        ''')
        user_input_remove = input()
        if user_input_remove == '1':
            remove_books()
        elif user_input_remove == '2':
            remove_reader()
        else:
            print('Please check the spelling')
    elif user_input == 6:
        con.close()
        break

Welcome to the Library managment system

    Please choose an option from below menu:
    1. Issue a book
    2. Return a book
    3. View records
    4. Update records
    5. Remove records
    6. Exit

 3

Records tables :
books
reader
bookissued

Please select a table to view reader

Table : reader

   r_id  r_name
0  1001    Arun
1  1002    Rick
2  1003   Morty
3  1004  Summer
4  1005   Jerry

Welcome to the Library managment system

    Please choose an option from below menu:
    1. Issue a book
    2. Return a book
    3. View records
    4. Update records
    5. Remove records
    6. Exit

 5

Please select a table :
        1. books
        2. reader

 1

,b_id,b_name,b_author,b_genre,b_availablity
0,3,Harry Potter and the Philosopher Stone,J. K. Rowling,Fantasy,Available
1,4,Harry Potter and the Goblet of Fire,J. K. Rowling,Fantasy,Issued
2,5,Blood of Elves,Andrzej Sapkowski,Fantasy,Issued
3,6,Time of Contempt,Andrzej Sapkowski,Fantasy,Available
4,7,Baptism of Fire,Andrzej Sapkowski,Fantasy,Available
5,8,The Tower of the Swallow,Andrzej Sapkowski,Fantasy,Issued
6,9,The Lady of the Lake,Andrzej Sapkowski,Fantasy,Issued
7,10,The Hunger Games,Suzanne Collins,Science fiction,Available

enter the book id 10

OperationalError: database is locked

### References

All the codes are done from scratch no references

In [13]:
con.close()